#pragma once

/*
	Перелік типів документів, що
	підтримуються в програмі
*/
enum DocumentType
{
	Statement, // Заява, має значення 0
	Report,	   // Звіт, має значення 1
	Order,     // Наказ, має значення 2
	Unknown,   // Невідомий тип документа, має значення 3
};

/*
	Статус документа.
	В конкретний момент часу, 
	в документа може бути тільки
	один статус!

	Для економії пам'яті можна 
	використати бітові поля (bit fields),
	які визначають діапазон можливих значень

*/
union DocumentStatus
{
	bool Active : 1;   // Діючий документ
	bool Archived : 1; // Архівний документ
	bool Unknown : 1;  // Невизначений 
};

/*
	Інтерфейс, який описує ТІЛЬКИ
	ЗАГАЛЬНІ функціональні
	можливості документа, тому він
	не може мати реалізації.

	Через відсутність реалізації можна
	увесь код розмістити в
	заголовочному файлі (.h)

*/

class IDocument
{
	/*
		Інтерфейс повинен складатись
		тільки з відкритих методів (функцій)
	*/
public:
	// Отримати ПІБ автора документа
	virtual const char* GetAuthorFullName() const = 0;
	// Отримати час та дату останніх змін документа
	virtual unsigned long GetLastModifiedTimeStamp() const = 0;
	// Отримати тип документа (заява, звіт і т.д.)
	virtual DocumentType GetType() const = 0;
	// Задати тип документа

};

// Відомості про автора документа
struct AuthorMetaData
{
	char* FirstName;	// Ім'я
	char* SecondName;	// Прізвище

	// Сформувати ПІБ автора
	char* GetFullName() const;
};