/*
*  Директива #pragma once
*  вказує на те, що під час процесу
*  зв'язування (linking) поточний
*  заголовочний файл буде підключатись
*  (в директиві #include) тільки один раз,
*  щоб уникнути конфліктів з іншими файлами
*  в яких також використовується
*  поточний заголовочний файл
*/
#pragma once

/*
* Підключення всіх необхідних
* заголовочних файлів в одному місці
* 
* Для кожного окремого класу
* бажано створювати окремі файли (з однаковими назвами):
* заголовочний (.h) та реалізації (.cpp)
*/ 

/*
* Підключити стандартні заголовочні файли.
* Стандартні заголовочні файли ОБОВ'ЯЗКОВО
* вказуються в кутових дужках!
*/
#include<iostream>
/*
* Підключити власні заголовочні файли.
* Власні заголовочні файли ОБОВ'ЯЗКОВО
* вказуються в подвійних лапках!
*/
#include"IDocument.h"
#include"OrderBase.h"
#include"MinistryOrder.h"

/*
* Підключити функціональні можливості
* стандартної бібліотеки
*/ 
using namespace std;
// Підключити створені користувачем функціональні можливості
using namespace MyDocuments;